# 敏感度(Sensitivity)也可稱為真陽性率(True-Positive rate, TP): P(陽性|有病)
# 特異度(Specificity)也可稱為真陰性率(True-Negative rate, TN): P(陰性|沒病)
# (1-特異度)又被稱做為       偽陽性率(False-Positive rate, FP): P(陽性|沒病)
# (1-敏感度)又被稱做為       偽陰性率(False-Negative rate, FN): P(陰性|有病)
敏感度<-50/(50+1)  # 敏感度
敏感度
特異度<-27/(27+22) # 特異度
特異度
1-敏感度  # 偽陰性率
1-特異度  # 偽陽性率

# 陽性預測值(Positive Predictive Value, PPV)= 檢驗陽性者真正有病的機率:　P(有病｜陽性)
# 陰性預測值(Negative predictive value, NPV)= 檢驗陰性者真正沒病的機率:　P(沒病｜陰性)
# ESR
(0.2*0.78)/((0.2*0.78)+(1-0.2)*(1-0.67))
敏感度<-156/(156+44)  # 敏感度
敏感度
特異度<-536/(536+264) # 特異度
特異度
敏感度<-0.78
特異度<-0.67
盛行率<-0.2
(盛行率*敏感度)/((盛行率*敏感度)+(1-盛行率)*(1-特異度))     # 陽性預測值
((1-盛行率)*特異度)/(((1-盛行率)*特異度)+盛行率*(1-敏感度)) # 陰性預測值
# PPV = TP/(TP + FP)
# NPV = TN/(TN + FN) 
156/(156+264) # PPV = TP/(TP + FP)
536/(536+44) # NPV = TN/(TN + FN) 
盛行率<-0.1
(盛行率*敏感度)/((盛行率*敏感度)+(1-盛行率)*(1-特異度))     # 陽性預測值
((1-盛行率)*特異度)/(((1-盛行率)*特異度)+盛行率*(1-敏感度)) # 陰性預測值
盛行率<-0.01
(盛行率*敏感度)/((盛行率*敏感度)+(1-盛行率)*(1-特異度))     # 陽性預測值
((1-盛行率)*特異度)/(((1-盛行率)*特異度)+盛行率*(1-敏感度)) # 陰性預測值
盛行率<-0.5
(盛行率*敏感度)/((盛行率*敏感度)+(1-盛行率)*(1-特異度))     # 陽性預測值
((1-盛行率)*特異度)/(((1-盛行率)*特異度)+盛行率*(1-敏感度)) # 陰性預測值
# MRI
# PPV = TP/(TP + FP)
# NPV = TN/(TN + FN) 
351/(351+32) # PPV = TP/(TP + FP)
598/(598+19) # NPV = TN/(TN + FN) 